---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotDrawWalls
source: html/362d9126-c574-bb4f-bbfa-31de5fe8ad2e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotDrawWalls Property

Can't make Wall.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotDrawWalls { get; }
```